

s = ["h", "i", "!"]

def reverse_string(s):
    return s[::-1]

print(reverse_string(s))


# 2 Написать декоратор, который перед